app/controllers/rides_controller.rb

  def index
    @rides = Ride.all
---
SELECT "rides".* FROM "rides"

  def update
    respond_to do |format|
      if @ride.update(ride_params)
---
UPDATE "rides" SET "park" = ?, "updated_at" = ? WHERE "rides"."id" = ?  [["park", 2], ["updated_at", 2016-11-03 04:59:37 UTC], ["id", 1]]

    def set_ride
      @ride = Ride.find(params[:id])
---
SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]